<a href="https://colab.research.google.com/github/Rahul0099/Rahul-/blob/main/Mean%20median%20histogram%20data%20lib.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
df = pd.read_csv("/content/Salaries.csv")

NameError: ignored

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("/content/Salaries.csv")

In [4]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [5]:
df.head(20)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500

In [6]:
df.head(50)mean

SyntaxError: ignored

In [7]:
df.phd.count()

78

In [8]:
df.phd.mean()

19.705128205128204

In [9]:
df.phd.median()

18.5

In [10]:
df.groupby('rank')

In [11]:
df_sub

NameError: ignored

In [12]:
df.groupby('rank')

In [13]:
df['salary']>120000

0      True
1     False
2     False
3      True
4     False
      ...
73    False
74    False
75     True
76    False
77    False
Name: salary, Length: 78, dtype: bool

In [14]:
df['salary']<150000

0     False
1      True
2      True
3      True
4      True
      ...
73     True
74     True
75     True
76     True
77     True
Name: salary, Length: 78, dtype: bool

In [15]:
df[df['salary']>120000]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
58  Prof          B   36       26  Female  144651
72  Prof          B   24       15  Female  161101
75  Prof          B   17       17  Female  124312

In [16]:
df.groupby['salary']

TypeError: ignored

In [17]:
df.groupby[50]

TypeError: ignored

In [18]:
df[start:stop-1,start:stop-1]

NameError: ignored

In [19]:
df.iloc[0:7]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [20]:
df.iloc[:,0:2]

         rank discipline
0        Prof          B
1        Prof          A
2        Prof          A
3        Prof          A
4        Prof          B
..        ...        ...
73       Prof          B
74  AssocProf          B
75       Prof          B
76       Prof          A
77       Prof          A

[78 rows x 2 columns]

In [21]:
df.iloc[1:3,0:2]

   rank discipline
1  Prof          A
2  Prof          A

In [22]:
df.iloc[[0,5],[1,3]]

  discipline  service
0          B       49
5          A       20

In [23]:
df.iloc[1:5,3:6]

   service   sex  salary
1        6  Male   93000
2       20  Male  110515
3       31  Male  131205
4       18  Male  104800

In [24]:
df.iloc[1:11,1:3]

   discipline  phd
1           A   12
2           A   23
3           A   40
4           B   20
5           A   20
6           A   20
7           A   18
8           A   29
9           A   51
10          B   39

In [25]:
df.iloc[,5:6]

SyntaxError: ignored

In [26]:
df.iloc[61]

rank          AssocProf
discipline            B
phd                  13
service              10
sex              Female
salary           103750
Name: 61, dtype: object

In [27]:
df.iloc[0,5:7]

salary    186960
Name: 0, dtype: object

In [28]:
df.iloc[0:61]

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000

[61 rows x 6 columns]

In [29]:
df.iloc[0:61,5:6]

    salary
0   186960
1    93000
2   110515
3   131205
4   104800
..     ...
56   77500
57   72500
58  144651
59  103994
60   92000

[61 rows x 1 columns]

In [30]:
df.iloc[0:61]

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
56  AssocProf          A   10        8  Female   77500
57   AsstProf          A    3        1  Female   72500
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000

[61 rows x 6 columns]

In [31]:
df.iloc[0:61,1:3]

   discipline  phd
0           B   56
1           A   12
2           A   23
3           A   40
4           B   20
..        ...  ...
56          A   10
57          A    3
58          B   36
59          B   12
60          B    3

[61 rows x 2 columns]

In [32]:
df.iloc[,5:6]

SyntaxError: ignored

In [33]:
df.iloc[56]

rank          AssocProf
discipline            A
phd                  10
service               8
sex              Female
salary            77500
Name: 56, dtype: object

In [34]:
df.iloc[{59}]

TypeError: ignored

In [35]:
df.iloc[[,2:3]]

SyntaxError: ignored

In [36]:
df.iloc[:,2:3]

    phd
0    56
1    12
2    23
3    40
4    20
..  ...
73   18
74   19
75   17
76   28
77   23

[78 rows x 1 columns]

In [37]:
df.iloc[0:60,1:5]

   discipline  phd  service     sex
0           B   56       49    Male
1           A   12        6    Male
2           A   23       20    Male
3           A   40       31    Male
4           B   20       18    Male
5           A   20       20    Male
6           A   20       17    Male
7           A   18       18    Male
8           A   29       19    Male
9           A   51       51    Male
10          B   39       33    Male
11          B   23       23    Male
12          B    1        0    Male
13          B   35       33    Male
14          B   25       19    Male
15          B   17        3    Male
16          B    8        3    Male
17          B    4        0    Male
18          A   19        7    Male
19          A   29       27    Male
20          B    4        4    Male
21          A   33       30    Male
22          A    4        2    Male
23          A    2        0    Male
24          A   30       23    Male
25          B   35       31    Male
26          A   38       19    Male
27          A   45       43    Male
28          B    7        2    Male
29          B   21       20    Male
30          B    9        7    Male
31          B   22       21    Male
32          A   27       19    Male
33          B   18       18    Male
34          B   12        8    Male
35          B   28       23    Male
36          B   45       45    Male
37          A   20        8    Male
38          B    4        3    Male
39          B   18       18  Female
40          A   39       36  Female
41          A   13        8  Female
42          B    4        2  Female
43          B    5        0  Female
44          B   23       19  Female
45          B   25       25  Female
46          B   11        3  Female
47          B   11       11  Female
48          B   17       17  Female
49          B   17       18  Female
50          B   10        5  Female
51          B   20       14  Female
52          A   12        0  Female
53          A    5        3  Female
54          A   25       22  Female
55          A    2        0  Female
56          A   10        8  Female
57          A    3        1  Female
58          B   36       26  Female
59          B   12       10  Female

In [38]:
df[['phd,'salary']].agg(['min','max','mean'])

SyntaxError: ignored

In [39]:
df[['phd,'salary']].agg(['min'])

SyntaxError: ignored

In [40]:
df[['phd','salary']].agg(['min'])

     phd  salary
min    1   57800

In [41]:
df[['phd','salary']].agg(['min','max','mean'])

            phd         salary
min    1.000000   57800.000000
max   56.000000  186960.000000
mean  19.705128  108023.782051

In [42]:
## import plot

In [43]:
## import plotlib

In [44]:
## import matplotlib

In [45]:
import pandas as pd

In [46]:
import matplotlib.pylot as plt
import seaborn as sns

ModuleNotFoundError: ignored

In [47]:
import matplotlib.pylot as plt

ModuleNotFoundError: ignored

In [48]:
## import matplotlib.pylot as plt

In [49]:
## import seaborn as sns

In [50]:
#plt.subplot(1,2,3)

In [52]:
data=pd.read_csv("/content/train.csv")
data,head()

NameError: ignored

In [53]:
data=pd.read_csv("/content/train.csv")
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [54]:
print(data.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [55]:
data.groupby('survived')['Passengerid'].count()

KeyError: ignored

In [56]:
data.groupby('Survived')['Passengerid'].count()

KeyError: ignored

In [57]:
data.groupby('Survived')['PassengerId'].count()

Survived
0    549
1    342
Name: PassengerId, dtype: int64

In [58]:
f, ax=plt.subplots(figsize=(10,8))
sns.barplot(x='sex',y='Survived', data=data)

NameError: ignored

In [59]:
f, ax = plt.subplots(figsize=(10,8))
sns.barplot(x='sex',y='Survived', data=data);

NameError: ignored

In [60]:
f, ax = plt.subplots(figsize=(10,8))
sns.barplot(x='Sex',y='Survived', data=data);

NameError: ignored